import styles from "./index.module.less";

const MixMode = () => {
  return <div className={styles.main}>
    <h3>mix-blend-mode 和 background-blend-mode 一起使用达到特殊效果</h3>
    <div className={styles.list}>
      <div>
        <p>单一效果</p>
        <div className={styles.single}  />
      </div>
      <div>
        <p>after 单一效果</p>
        <div className={styles.singleAfter}  />
      </div>
      <div>
        <p>混合效果</p>
        <div className={styles.mix}  />
      </div>
      <div>
        <p>gif混合效果</p>
        <div className={styles.mixGif}  />
      </div>
      <div>
        <p>不同的图混合</p>
        <div className={styles.mixDiff}  />
      </div>
      <div>
        <p>不同的图混合2</p>
        <div className={styles.mixDiffWhite}  />
      </div>
      <div style={{background: "#000", color: "white"}}>
        <p>文字效果</p>
        <div className={styles.unbelievableText}>
          混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合
        </div>
      </div>
      <div style={{width: "100%"}}>
        <p>走马灯效果</p>
        <div className={styles.stage}>
          <div className={styles.carousel}>
            <div><div>混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会</div></div>
            <div><div>混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会</div></div>
            <div><div>混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会</div></div>
            <div><div>混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会</div></div>
            <div><div>混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会</div></div>
            <div><div>混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会保留而暗部则会与黑色背景融合混合模式的叠加处理文字的亮部将会</div></div>
          </div>
        </div>
      </div>
    </div>
  </div>
}

export default MixMode;